docs/package dmp/DMP-LPS-Code-Exemple_C#dotNET-v2.06.01/TLSiKitEditeurTests/Resources/wsdl/wsdl/PDQSupplier.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
    DMP1 - Interfaces LPS
    WSDL de definition du service : PDQ HL7 V3 (recherche sans INS)
    VERSION : 1.0.0
    DATE    : 03/11/2010
-->
<definitions name="PDQSupplier" targetNamespace="urn:ihe:iti:pdqv3:2007"
    xmlns:tns="urn:ihe:iti:pdqv3:2007" xmlns:wsoap11="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:hl7="urn:hl7-org:v3">
    <documentation>Example WSDL for PDQ Patient Demogrpahics Supplier</documentation>
    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="urn:hl7-org:v3"
            xmlns:hl7="urn:hl7-org:v3">
            <!-- Include the message schema -->
            <xsd:include schemaLocation="schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201305UV02.xsd"/>
        </xsd:schema>
        <xsd:schema elementFormDefault="qualified" targetNamespace="urn:hl7-org:v3"
            xmlns:hl7="urn:hl7-org:v3">
            <!-- Include the message schema -->
            <xsd:include schemaLocation="schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"/>
        </xsd:schema>
    </types>
    <message name="PRPA_IN201305UV02_Message">
        <part element="hl7:PRPA_IN201305UV02" name="Body"/>
    </message>
    <message name="PRPA_IN201306UV02_Message">
        <part element="hl7:PRPA_IN201306UV02" name="Body"/>
    </message>
 
    <portType name="PDQSupplier_PortType">
        <operation name="findCandidatesQuery">
            <input message="tns:PRPA_IN201305UV02_Message"
                wsaw:Action="urn:hl7-org:v3:PRPA_IN201305UV02"/>
            <output message="tns:PRPA_IN201306UV02_Message"
                wsaw:Action="urn:hl7-org:v3:PRPA_IN201306UV02"/>
        </operation>
      
    </portType>
    <binding name="PDQSupplier_Binding_Soap12" type="tns:PDQSupplier_PortType">
        <wsoap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="findCandidatesQuery">
            <wsoap12:operation soapAction="urn:hl7-org:v3:PRPA_IN201305UV02"/>
            <input>
                <wsoap12:body use="literal"/>
            </input>
            <output>
                <wsoap12:body use="literal"/>
            </output>
        </operation>
 
    </binding>
    <service name="PDQSupplier_Service">
        <port binding="tns:PDQSupplier_Binding_Soap12" name="PDQSupplier_Port_Soap12">
            <wsoap12:address location="https://servicelocation/PDQ"/>
        </port>
    </service>
</definitions>
