ESBComponents/MessageValidator/src/test/resources/Scenario3_PD_Response.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:xs="http://www.w3.org/2001/XMLSchema"
	xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201306UV02:CrossGatewayPatientDiscovery
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:45a19617-4ed9-4d61-ad22-f269ccde89f3
		</MessageID>
		<RelatesTo xmlns="http://www.w3.org/2005/08/addressing">uuid:657eef1b-4e7f-4542-b02d-0093fa535dbe</RelatesTo>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp
				xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_1">
				<wsu:Created>2012-02-06T19:15:02Z</wsu:Created>
				<wsu:Expires>2012-02-06T19:20:02Z</wsu:Expires>
			</wsu:Timestamp>
			<wsse11:SignatureConfirmation
				xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_5002"
				Value="EwSTI0nH7aC987G01YpHlLPInrOlJ9IR/bkzsObuNpYG0MNo/VlHDGqA2olF0wypBROrv0zihcnP7pdX3865cYCo1Rj/0LWICuIcFqlOofWgtNaEhtG/Mg86gm9Aj5F5wEeaSm5VDvxZaYPBInO7sT7gciQ0GQcqYj3stOioY6l51pG9SBA0lxxEZ/oXweER7P06rt6xaUVjTIfnGo11+mql5HnIVEKw/NDZk59A4A5hFCS0NmA9rrMDe6Hb1bQQR1nnd9yrJA5vJPibianR8lUfUib2hIWM2T4UnL/dPSjKdxO2/1labI905MGtPhmpPHIc0gwMs0JUiSHIGniXjQ==" />
		</wsse:Security>
	</S:Header>
	<S:Body>
		<PRPA_IN201306UV02 xmlns="urn:hl7-org:v3"
			xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing"
			xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade"
			ITSVersion="XML_1.0">
			<id extension="-383d392:1354b81a6ee:-7ef1" root="2.16.840.1.113883.0.210" />
			<creationTime value="201226191450" />
			<interactionId extension="PRPA_IN201306UV" root="2.16.840.1.113883.1.6" />
			<processingCode code="P" />
			<processingModeCode code="R" />
			<acceptAckCode code="AL" />
			<receiver typeCode="RCV">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999" />
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE"
							classCode="ORG">
							<id root="2.16.840.1.113883.0.102" />
						</representedOrganization>
					</asAgent>
				</device>
			</receiver>
			<sender typeCode="SND">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999" />
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE"
							classCode="ORG">
							<id root="2.16.840.1.113883.0.210" />
						</representedOrganization>
					</asAgent>
				</device>
			</sender>
			<acknowledgement>
				<typeId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6" />
				<typeCode code="AA" />
				<targetMessage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
					xsi:nil="true" />
			</acknowledgement>
			<controlActProcess moodCode="EVN" classCode="">
				<code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV" />
				<authorOrPerformer typeCode="AUT">
					<assignedDevice classCode="">
						<id root="2.16.840.1.113883.0.210" />
					</assignedDevice>
				</authorOrPerformer>
				<subject typeCode="SUBJ">
					<registrationEvent moodCode="" classCode="">
						<id nullFlavor="NA" />
						<statusCode code="active" />
						<subject1 typeCode="">
							<patient classCode="PAT">
								<id extension="VEN21000008" root="2.16.840.1.113883.0.210" />
								<statusCode code="SD" />
								<patientPerson>
									<name>
										<family partType="FAM">Fleming</family>
										<given partType="GIV">Jennifer</given>
										<given partType="GIV">B</given>
										<prefix partType="PFX">Mrs</prefix>
									</name>
									<telecom value="tel:+1-408-454-9800" />
									<administrativeGenderCode code="F" />
									<birthTime value="19400807" />
									<addr>
										<streetAddressLine>4000 Minor St</streetAddressLine>
										<city>Phoenix</city>
										<state>AZ</state>
										<postalCode>85001</postalCode>
									</addr>
									<asOtherIDs classCode="SD">
										<id extension="666660008" root="2.16.840.1.113883.4.1" />
										<scopingOrganization determinerCode=""
											classCode="">
											<id root="2.16.840.1.113883.4.1" />
										</scopingOrganization>
									</asOtherIDs>
								</patientPerson>
								<providerOrganization determinerCode=""
									classCode="">
									<id root="2.16.840.1.113883.0.210" />
									<contactParty xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
										xsi:nil="true" />
								</providerOrganization>
								<subjectOf1>
									<queryMatchObservation moodCode=""
										classCode="">
										<code code="IHE_PDQ" />
										<value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
											xsi:type="INT" value="100" />
									</queryMatchObservation>
								</subjectOf1>
							</patient>
						</subject1>
						<custodian typeCode="">
							<assignedEntity classCode="">
								<id root="2.16.840.1.113883.0.210" />
							</assignedEntity>
						</custodian>
					</registrationEvent>
				</subject>
				<queryAck>
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.102" />
					<queryResponseCode code="OK" />
					<resultTotalQuantity value="1" />
					<resultCurrentQuantity value="1" />
					<resultRemainingQuantity value="0" />
				</queryAck>
				<queryByParameter xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
					xsi:nil="true">
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.102" />
					<statusCode code="new" />
					<responseModalityCode code="R" />
					<responsePriorityCode code="I" />
					<parameterList>
						<livingSubjectAdministrativeGender>
							<value code="F" />
							<semanticsText representation="TXT" />
						</livingSubjectAdministrativeGender>
						<livingSubjectBirthTime>
							<value value="19400807" />
							<semanticsText representation="TXT" />
						</livingSubjectBirthTime>
						<livingSubjectId>
							<value extension="RI2.102.00008" root="2.16.840.1.113883.0.102" />
							<semanticsText representation="TXT" />
						</livingSubjectId>
						<livingSubjectId>
							<value extension="666660008" root="2.16.840.1.113883.4.1" />
							<semanticsText representation="TXT" />
						</livingSubjectId>
						<livingSubjectName>
							<value>
								<family partType="FAM">Fleming</family>
								<given partType="GIV">Jennifer</given>
							</value>
							<semanticsText representation="TXT" />
						</livingSubjectName>
						<patientAddress>
							<value>
								<streetAddressLine>4000 Minor St</streetAddressLine>
								<city>Phoenix</city>
								<state>AZ</state>
								<postalCode>85001</postalCode>
							</value>
						</patientAddress>
						<patientTelecom>
							<value value="tel:+1-408-454-9800" />
							<semanticsText representation="TXT" />
						</patientTelecom>
					</parameterList>
				</queryByParameter>
			</controlActProcess>
		</PRPA_IN201306UV02>
	</S:Body>
</S:Envelope>